20220128091547-discrete_set.tex
% Created 2022-02-17 Thu 03:34
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{minted}
\usepackage{tikz}
\usetikzlibrary{positioning}
\usepackage[margin=1in]{geometry}
\usepackage[margin=1in]{pgfplots}
\renewcommand{\Large}{\normalsize}
\author{Amar Panji Senjaya}
\date{\textit{[2022-01-28 Fri 09:15]}}
\title{Discrete-Set}
\hypersetup{
 pdfauthor={Amar Panji Senjaya},
 pdftitle={Discrete-Set},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\pgfplotsset{ compat=1.3, compat/path replacement=1.5.1,}\\
\setlength\parindent{0pt}
\newpage

Source And Learning Material:\\
\url{https://www.youtube.com/playlist?list=PLHXZ9OQGMqxersk8fUxiUMSIx0DBqsKZS}\\
\url{https://www.amazon.com/Discrete-Mathematics-Applications-Susanna-Epp/dp/1337694193/ref=sr\_1\_2?keywords=discrete+math\&qid=1645043639\&sr=8-2}\\

\section{What is Set}
\label{sec:orgf939808}
A \textbf{set} is a collection of objects. Individual object of set is element \(\in\). Individual object of element that is not in The set is  called not in element denoted with \(\notin\).\\
\subsection{Examples}
\label{sec:org6fd382b}
\begin{itemize}
\item A = Employees in a company\\
John \(\in\) A\\
\item B = \{1,3,4,7\}\\
3 \(\in\) A\\
\(\pi\) \(\notin\) B\\
\item Z = Integers\\
3 \(\in\) Z\\
\end{itemize}

\subsection{Order And Repetition Don't Matter}
\label{sec:org214a35d}
\begin{minted}[]{markdown}
{1, 2, 3, 4, 5, 6, 7} = {2, 5, 4, 3, 1, 7, 6}
			= {2, 2, 2, 2, 5, 4, 3, 1, 1, 7, 6, 6, 6}
\end{minted}

\newpage

\section{Subsets}
\label{sec:org76d6b5e}
\begin{itemize}
\item Every Element of A is also in B = A \subseteq B\\
\end{itemize}
\subsubsection{Example 1}
\label{sec:orga89c59a}
A = \{1, 3\}\\
B = \{1, 3, 4, 6\}\\
A \subseteq B\\
\subsubsection{Example 2}
\label{sec:orgb41d041}
A = \{1, 8\}\\
B = \{1, 3, 4, 6\}\\
A \nsubseteq B\\
because \(\in\) 8 is not in B\\

\section{Set-Roster Notion}
\label{sec:org209d0b0}
Replace \ldots{} with continuos clear pattern\\
Example:\\
Positive even integers\\
\{0, 2, 4, 6, \ldots{}\}\\
all even integers\\
\{\ldots{}, -6, -4, -2, 0, 2, 4, 6, \ldots{}\}\\

\section{Set-Builder Notation}
\label{sec:orgbbf9d16}
General form: \{ x | P(x) \}\\
x variable\\
"|" such that\\
P(x) Property is true\\
Example even integers\\
= \{ x | x = Twice an integer \}\\
Example square root\\
\{ x | \sqrt{x} \(\in\) \mathbb{Z} \}\\

\newpage

\section{Empty Set}
\label{sec:orgaf9c158}
Notion: \{\} or \(\emptyset\)\\
\{\(\emptyset\)\}\\
Is \(\emptyset\) \(\subset\) \{1,2,3\}?\\
Recall: A \(\subset\) B means:\\
if x \(\in\) A, then x \(\in\) B\\
This is \emph{vacuously} true!\\

\section{Ordered Pairs (\emph{a}, \emph{b})}
\label{sec:orga527ef1}
\begin{itemize}
\item Order Matters\\
\item (a,b) = (c,d) of a=c \& b=d\\
\item a\&b could come from different sets\\
\end{itemize}

\uline{Defn}: The cartesian product A \texttimes{} B is the set of all ordered pairs (a,b) where a \(\in\) A and b \(\in\) B\\

\begin{tikzpicture}
\begin{axis}[legend entries={p},ymin=-2,ymax=2,xmin=-2,xmax=2, axis lines=middle,axis equal,grid=both]
\addplot coordinates{(2,1)};
\end{axis}
\end{tikzpicture}

p = (2,1) \(\in\) \mathbb{R} x \mathbb{R}\\
first component is x axis and second component is y axis\\

Example:\\
\{a,b\} \texttimes{} \{0,1\}\\
A \texttimes{} B = \{(a,1), (a,0), (b,0), (b1)\}\\

\section{Relations}
\label{sec:org97a7538}
Ex: a < b\\
compares two integers\\
some pairs have this relationship 2 < 5\\
some pairs don't 5 \nless 2\\

note:\\
h: human\\
d: dog\\
c: cat\\
m: monkey\\
\begin{tikzpicture}[
mydot/.style={
  circle,
  fill,
  inner sep=2pt
},
>=latex,
shorten >= 3pt,
shorten <= 3pt
]
\node[mydot,label={left:h1}] (h1) {}; 
\node[mydot,below=of h1,label={left:h2}] (h2) {}; 
\node[mydot,below=of h2,label={left:h3}] (h3) {}; 
\node[mydot,below=of h3,label={left:h4}] (h4) {}; 

\node[mydot,right=2cm of h1,label={right:d1}] (d1) {}; 
\node[mydot,below=of d1,label={right:c1}] (c1) {}; 
\node[mydot,below=of c1,label={right:d2}] (d2) {}; 
\node[mydot,below=of d2,label={right:m1}] (m1) {}; 

\path[->] (h1) edge (c1);
\path[->] (h2) edge (d1);
\path[->] (h3) edge (d1);
\end{tikzpicture}

\uline{defn}: A Relation R between A and B is a subset of A \texttimes{} B\\

ie ordered pairs\\
(a,b) \(\in\) A \texttimes{} B\\
\section{Functions}
\label{sec:org8b299e1}
ex: f(x) = x\textsuperscript{2}\\

\begin{tikzpicture}
\begin{axis}[legend entries={f},ymin=-2,ymax=2,xmin=-2,xmax=2, axis lines=middle,axis equal,grid=both]
\addplot {(x^2)};
\end{axis}
\end{tikzpicture}

function do something to every input in my domain and produce output for each input\\

domain: set of all possible input\\
range: set of all possible output\\

\uline{Defn}: A function F between A and B\\
is a relation between A and B such that:\\
subset of A \texttimes{} B\\

\begin{enumerate}
\item For every x \(\in\) A there is an element y \(\in\) B such that (x,y) \(\in\) F\\
Which means\\
Fo every input x, there is some ouput y, F(x)=y\\
\item If (x,y) \(\in\) F and (x,z) \(\in\) F then y = z\\
\end{enumerate}


Example: Is this relation?\\
Consider the relation C where (x,y) \(\in\) C if x\textsuperscript{2} + y\textsuperscript{2} = 1. Is this a function?\\
\begin{tikzpicture}
\begin{axis}[legend entries={f},ymin=-2,ymax=2,xmin=-2,xmax=2, axis lines=middle,axis equal,grid=both, extra tick style={grid=major}]
\addplot coordinates{(0,1)};
\draw (axis cs:0,0) circle[radius=1];
\end{axis}
\end{tikzpicture}

This is relation but not a function because there is more than one output asociated with one input\\


\section{Statement}
\label{sec:orgb9c182e}
A statement is a sentence that is either true or false\\

Examples:\\
p: "5 > 2" = True\\
q: "2 > 5" = False\\
r: "x > 2" = Not a statement because we don't know what x is\\

\subsection{New statement from old}
\label{sec:org0f4d944}
\(\neg{}\) p means not p\\
p \(\land\) q means p and q\\
p \(\lor\) q means p or q\\

Example:\\
"My shirt is gray but my shorts are not"\\
p = My shirt is gray\\
q = My shorts are gray\\
p\(\land\) \(\neg{}\) q\\

\subsection{Truth Table for (\(\neg{}\) p) \(\lor\) (\(\neg{}\) q)}
\label{sec:orgfed8652}
\begin{center}
\begin{tabular}{lllll}
p & q & \(\neg{}\) p & \(\neg{}\) q & \\
\hline
T & T & F & F & F\\
T & F & F & T & T\\
F & T & T & F & T\\
F & F & T & T & T\\
\end{tabular}
\end{center}

Def: Two statements are logically equivalent if they have the same truth table\\
\begin{center}
\begin{tabular}{lll}
p & \(\neg{}\) p & \(\neg{}\) (\(\neg{}\) p)\\
\hline
T & F & T\\
F & T & F\\
\end{tabular}
\end{center}

Def: A tautology t is a statement that is always true\\
Example:\\
That dog is a mammal\\

t: tautology\\
p: some statement\\
\begin{center}
\begin{tabular}{lll}
t & p & t \(\lor\) p\\
\hline
T & T & T\\
T & F & T\\
\end{tabular}
\end{center}


Def: A contrandiction c is a statement that is always false\\
Example:\\
That dog is a reptile\\

c: contrandiction\\
p: some statement\\
\begin{center}
\begin{tabular}{lll}
c & p & c \(\land\) p\\
\hline
F & T & F\\
F & F & F\\
\end{tabular}
\end{center}

so c \(\land\) p is a contrandiction\\

\section{Demorgan's Law \& Logical Equivalent}
\label{sec:orgb2cabab}
p: Trefor is a unicorn\\
q: Trefor is a goldfish\\
\(\neg{}\)(p \(\lor\) q) \(\equiv\) (\(\neg{}\) p) \(\land\) (\(\neg{}\) q)?\\
It's NOT the case that Trefor is either a unicorn OR a goldfish.\\
is equivalent to:\\
Trefor is NOT a unicorn AND is NOT a goldfish.\\

\begin{center}
\begin{tabular}{lllllll}
p & q & \(\neg{}\) p & \(\neg{}\) q & p \(\lor\) q & \(\neg{}\) (p \(\land\) q) & (\(\neg{}\) p) \(\land\) (\(\neg{}\) q)\\
\hline
T & T & F & F & T & F & F\\
T & F & F & T & T & F & F\\
F & T & T & F & T & F & F\\
F & F & T & T & F & T & T\\
\end{tabular}
\end{center}

Demorgan's Laws:\\
\(\neg{}\) (p \(\lor\) q) \(\equiv\) (\(\neg{}\) p) \(\land\) (\(\neg{}\) q)\\
\(\neg{}\) (p \(\land\) q) \(\equiv\) (\(\neg{}\) p) \(\lor\) (\(\neg{}\) q)\\

Double Negative:\\
\(\neg{}\)(\(\neg{}\) p) \(\equiv\) p\\

Identity Laws:\\
p \(\lor\) c \(\equiv\) p\\
p \(\land\) t \(\equiv\) p\\

Universal Bound Laws:\\
p \(\lor\) t \(\equiv\) t\\
p \(\land\) c \(\equiv\) c\\

Example:\\
(\(\neg{}\)(p \(\lor\) \(\neg{}\) q)) \(\land\) t\\
via DeMorgan's\\
\(\equiv\) (\(\neg{}\) p \(\land\) \(\neg{}\) (\(\neg{}\) q)) \(\land\) t\\
via Double Negative\\
\(\equiv\) (\(\neg{}\) p \(\land\) q) \(\land\) t\\
Via Identity\\
\(\equiv\) \(\neg{}\) p \(\land\) q\\
\end{document}